Autodesk.Revit.DB.Visual.Tile.TextureVRepeat
The property labeled "V Repeat" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TextureURepeat
The property labeled "U Repeat" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TextureScaleLock
The property labeled "Scale Lock" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TextureRealWorldScaleY
The property labeled "Size Y" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TextureRealWorldScaleX
The property labeled "Size X" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TextureWAngle
The property labeled "Angle" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 360".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TextureOffsetLock
The property labeled "Offset Lock" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TextureRealWorldOffsetY
The property labeled "Offset Y" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TextureRealWorldOffsetX
The property labeled "Offset X" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TextureLinkTextureTransforms
The property labeled "Link Transforms" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileChangeColumn
The property labeled "Amount" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 5".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TilePerColumn
The property labeled "Every" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyInteger" within the range of "0, 50".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileUseColumnEdit
The property labeled "Column Modify" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileChangeRow
The property labeled "Amount" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 5".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TilePerRow
The property labeled "Every" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyInteger" within the range of "0, 50".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileUseRowEdit
The property labeled "Row Modify" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileRandomShift
The property labeled "Random" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileLineShift
The property labeled "Line Shift" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileEdgeRoughness
The property labeled "Roughness" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 200".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileVerticalGap
The property labeled "Vert" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileHorizontalGap
The property labeled "Gap Width" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileMortarColor
The property labeled "Grout Color" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileRandomSeed
The property labeled "Randomize" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyInteger" with a minimum of "0".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileFadeVariance
The property labeled "Fade Variance" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileColorVariance
The property labeled "Color Variance" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileBrickColor
The property labeled "Tile Color" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileVerticalCount
The property labeled "tile_VerticalCount" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileHorizontalCount
The property labeled "Tile Count" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile.TileBrickType
The property labeled "Type" from the "Tile" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "TileBrickType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Tile
Represents the properties of materials.
Since:
2018.1